---
kind: type
id: T:Autodesk.Revit.DB.SATExportOptions
source: html/c0b21f2b-3405-bfc9-2e22-6ff3a6d55c41.htm
---
# Autodesk.Revit.DB.SATExportOptions

The export options used by exporting SAT format file. So far, there is no option in it.

## Syntax (C#)
```csharp
public class SATExportOptions : IDisposable
```